Obtains the subregion object represented by this element.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public SiteSubRegion AsSiteSubRegion()
  Visual Basic
Public Function AsSiteSubRegion As SiteSubRegion
  Visual C++
public:
SiteSubRegion^ AsSiteSubRegion()
 Return Value
 The SiteSubRegion element. If this does not represent a SiteSubRegion, this will be    a null reference (  Nothing  in Visual Basic)  .
 Remarks
 This applies to TopographySurface and SiteSubRegion elements.
 See Also
  TopographySurface Class
  Autodesk.Revit.DB.Architecture Namespace